Merge pull request #49 from m10maeda/docs/use-mermaidjs-instead-of-plantuml
